### [실습1]

#### 1) 아래와 같은 데이터 프레임 생성

    School   Name  Math_s
0   Yeonhi  Haena      92
1   Yeonhi   Gisu      70
2  Sungsan    Una      88
3  Sungsan  Naeun      92
4  Sungsan   Ziho      70

#### 2) school을 그룹으로 하여 수학 성적의 평균 구한 결과를 df_s에 담기

    School      Avg_s
0  Sungsan  83.333333
1   Yeonhi  81.000000

#### 3) df 와 df_s 두 개의 데이터 프레임을 merge 한 후 df_m 에 담기

    School   Name  Math_s      Avg_s
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

#### 4) transform() 을 이용하여 3) 과 같은 결과를 출력

    School   Name  Math_s      Avg_s
0   Yeonhi  Haena      92  81.000000
1   Yeonhi   Gisu      70  81.000000
2  Sungsan    Una      88  83.333333
3  Sungsan  Naeun      92  83.333333
4  Sungsan   Ziho      70  83.333333

#### 5) 함수 grade(num) 를 작성

- num 이 90보다 크면 grade 는 A
- num 이 80보다 크면 grade 는 B
- num 이 70보다 크면 grade 는 C
- 그 외 grade 는 F
- 구한 grade 리턴

#### 6) df_m 에 grade 컬럼을 생성한 후 Math_s 컬럼을 이용하여 함수 grade 적용

    School   Name  Math_s      Avg_s grade
0   Yeonhi  Haena      92  81.000000     A
1   Yeonhi   Gisu      70  81.000000     F
2  Sungsan    Una      88  83.333333     B
3  Sungsan  Naeun      92  83.333333     A
4  Sungsan   Ziho      70  83.333333     F

#### 7) sort_math() 함수 작성
- 각 school 별 Math_s 컬럼을 기반으로 가장 낮은 점수 2명에 대한 정보 리턴

#### 8) School을 기준으로 그룹을 설정한 후 sort_math() 함수를 적용

            School   Name  Math_s      Avg_s grade
School
Sungsan 4  Sungsan   Ziho      70  83.333333     F
        2  Sungsan    Una      88  83.333333     B
Yeonhi  1   Yeonhi   Gisu      70  81.000000     F
        0   Yeonhi  Haena      92  81.000000     A